# coding: utf-8
from bgnseg import BgnSeg

bgnseg = BgnSeg()

sentences = [u'家用意式咖啡机',
            u'贴纸高清防刮屏幕膜老款',
            u'小新潮超轻薄窄边框笔记本电脑',
            u'万彩双面胶带强力高粘带纸质墙面固定超薄透明不留痕胶布贴两面胶',
            u'手机套硅胶带挂绳手机壳全包边软壳',
            u'英寸画框幕布家用投影仪高清投影机家庭影院软幕投影幕布',
            u'直液式走珠笔学生用碳素笔头中性笔全针管签字水笔红色',
            u'尊首卫衣男加绒加厚宽松保暖连帽衫冬季青少年男士韩版潮流学生外套男',
            u'喇叭裤春装新款女宽松裤子高腰牛仔喇叭裤九分毛边微喇牛仔裤深宝蓝',
            u'观悦苹果6s手机壳ro膜防摔带指环支架iphone6plus硅胶全包软壳男女款保护套6P/6sPlus(大屏)5.5英寸-星空黑',
            u'伟易达儿童益智早教教具玩具车字母巴士多功能宝宝玩具字母巴士',
            u'Nespresso奈斯派索胶囊咖啡机全自动节能家用欧洲原装进口Inissia C40宝石红',
            u'飞利浦（PHILIPS）咖啡机家用全自动现磨一体带咖啡豆研磨功能 HD7751/00',
            u'德龙（Delonghi）EC330S泵压式咖啡机意式家用商用半自动打奶泡不锈钢爵士银',
            u'尚尚签联想S60-T手机套S60-W保护壳S60保护套S60T手机壳硅胶软壳送指环白底大格',
            u'酷斯基【送钢化膜】华为荣耀畅玩5x手机壳透明指环硅胶适用于KIW-AL/TL/UL00软壳经典玫瑰金带支架赠挂绳+钢化膜',
            u'Lomier小米max2定制手机壳创意个性文字黑边防摔软硅胶保护套适用于红米note2红米note2-5.5英寸早安，有好心情',
            u'GODEX 科诚（) EZ-1100plus 服装吊牌条码打印机 标签打印机 不干胶打印机 赠品三300米蜡基碳带']

for s in sentences:
  print s
  print '  '.join(bgnseg.cut(s))
